# LinearDimensionReferenceNotOrthogonalToView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..LinearDimensionReferenceNotOrthogonalToView Property
BuiltInFailures..::..DimensionFailures Class See Also
---
The planes of one or more references are not exactly orthogonal to this view. The dimension to these reference cannot be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LinearDimensionReferenceNotOrthogonalToView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinearDimensionReferenceNotOrthogonalToView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LinearDimensionReferenceNotOrthogonalToView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace